<?php

return [
    'titles' => [
        'programs' => 'البرامج',
        'dashboard' => 'لوحة التحكم',
        'new_record' => 'إضافة برنامج',
        'program_details' => 'تفاصيل البرنامج',
        'classes' => 'الحصص',
    ],

    'actions' => [
        'list' => 'قائمة البرامج',
        'add' => 'إضافة برنامج جديد',
        'edit' => 'تعديل البرنامج',
        'delete' => 'حذف البرنامج',
        'add_class' => 'إضافة حصة',
    ],

    'fields' => [
        'name' => 'اسم البرنامج',
        'name_en' => 'اسم البرنامج (إنجليزي)',
        'name_ar' => 'اسم البرنامج (عربي)',
        'name_ur' => 'اسم البرنامج (أردو)',
        'description' => 'الوصف',
        'start_date' => 'تاريخ البدء',
        'end_date' => 'تاريخ الانتهاء',
        'system' => 'النظام',
        'branch' => 'الفرع',
        'academy' => 'الأكاديمية',
        'price' => 'السعر',
        'currency' => 'العملة',
        'vat' => 'ضريبة القيمة المضافة',
        'class_count' => 'عدد الحصص',
        'days' => 'أيام البرنامج',
        'day' => 'اليوم',
        'start_time' => 'وقت البداية',
        'end_time' => 'وقت الانتهاء',
        'coach_name' => 'اسم المدرب',
        'location' => 'الموقع',
        'program' => 'البرنامج',
         'base_price' => 'السعر الأساسي',
        'vat' => 'ضريبة القيمة المضافة',
        'total' => 'الإجمالي مع الضريبة',
    ],
    'labels' => [
    'offer' => 'سعر العرض',
],

    'messages' => [
        'no_classes_found' => 'لا توجد حصص لهذا البرنامج.',
    ],
];
